{
  "posts": [
    {
      "movie": "The Seven Samurai",
      "genre": "Thriller",
      "description": "\"What's the use of worrying about your beard when your head's about to be taken?\" — Gisaku It's the only Japanese film on the list and later was remade as The Magnificent Seven, a Western with Steve McQueen and Charles Bronson.",
      "id": 4
    },
    {
      "movie": "Pan's Labyrinth",
      "genre": "fantasy",
      "description": "“Her father, the King, always knew that the Princess' soul would return, perhaps in another body, in another place, at another time. And he would wait for her, until he drew his last breath, until the world stopped turning...\" — Pan It's the only Spanish-language movie to make the list.....",
      "id": 5
    },
    {
      "movie": "The Deer Hunter",
      "genre": "Thriller",
      "description": "“You have to think about one shot. One shot is what it's all about. A deer's gotta be taken with one shot.” — Michael When John Cazale got sick during filming, the studio wanted to recast, but Streep threatened to walk off the picture if it did",
      "id": 6
    },
    {
      "movie": "Rocky",
      "genre": "Thriller",
      "description": "“Yo, Adrian! It's me, Rocky.” — Rocky Stallone wrote the script's first draft in just three days, then refused to sell it unless he was cast in the lead role trtyvrrn6en6m4",
      "id": 7
    },
    {
      "movie": "Memento",
      "genre": "Thriller",
      "description": "“Memory can change the shape of a room; it can change the color of a car. And memories can be distorted. They're just an interpretation, they're not a record, and they're irrelevant if you have the facts.” — Leonard Shelby Nolan reportedly was going to cast Alec Baldwin in Pearce's part, but he must have forgotten. ...",
      "id": 8
    },
    {
      "movie": "The Godfather",
      "genre": "Thriller",
      "description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son..",
      "id": 9
    }
  ]
}